{"id":841,"date":"2018-09-25T11:05:32","date_gmt":"2018-09-25T11:05:32","guid":{"rendered":"https:\/\/foss4g.asia\/2018\/?page_id=841"},"modified":"2018-11-08T08:38:42","modified_gmt":"2018-11-08T08:38:42","slug":"4ones-2","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2018\/4ones-2\/","title":{"rendered":"4ONES Workshop and Event"},"content":{"rendered":"<h2 style=\"font-weight: 400;\"><span style=\"color: #008080;\"><strong>4ONSE Event<\/strong><\/span><\/h2>\n<p>&nbsp;<\/p>\n<p style=\"font-weight: 400;\">4ONSE is the acronym for “4 times Open and Non-conventional technology for Sensing the Environment”, which is an ongoing research project between University of Moratuwa, Sri Lanka and University of Applied Sciences and Arts of Southern Switzerland. The project aims at developing an experimental, low budget weather station based on open source technologies – open hardware (Arduino), open software (istSOS), open data (CKAN) and open standards (OGC-SOS standards). The station is able to measure 8 environmental parameters – rainfall, temperature, atmospheric pressure, humidity, solar radiation, wind direction, wind speed and soil moisture. Already, 27 weather stations have been deployed in Deduru Oya basin, which is the selected river basin for this research. During the FOSS4G-Asia event, a special workshop will be conducted by the team members of the 4ONSE project.<\/p>\n<p style=\"font-weight: 400;\">The goal of this event is to provide participants with hands-on experience to build 4ONSE weather station using an open source electronic platform called Arduino and low cost sensors. The event will be divided into two parts. The first part will be a series of presentations providing an overview of the 4ONSE project and the lessons learnt by the project team. The second part will be a hands-on demonstration of building a 4ONSE weather station.<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"font-weight: 400;\"><span style=\"color: #008080;\"><strong>Workshop on Building a 4ONSE Weather Station<\/strong><\/span><\/h2>\n<h4><span style=\"color: #800000;\">Instructors: <strong>Rangajeewa Rathnayake, Massimiliano Cannata , B.H. Sudantha<\/strong><\/span><\/h4>\n<p>The workshop is dedicated to professionals, researchers and students who want to build a non- conventional and low-cost weather station. We termed this weather station 4ONSE as it is 4 times open: Open Hardware, Open Software, Open Standards and Open Data. “Non-conventional” means we intend a low-cost system which does not respect all the high standard requirements in term of sensor construction, precision and testing and, finally, for “effective way” we intend to adapt to meet the users’ needs. In this workshop, participants will have an opportunity to build a weather station with the electronic engineers’ assistance. <u>User manual, sensors, Arduino board, other necessary electronic items, solar panel, battery and a pole will be provided at the workshop.<\/u><\/p>\n<p>&nbsp;<\/p>\n<p><strong><em><u>Pre-requisite knowledge for the attendees\/background of participants<\/u><\/em><\/strong><\/p>\n<p>This workshop intends to train irrigation engineers, agricultural researchers, metrological officers,  students and farmers on how to program computers and sensors to take temperature, soil moisture, humidity, rain measurements. Pre-requisite knowledge in Arduino and open source electronic platforms will be desirable. We will limit the workshop to 15 participants.<\/p>\n<p>&nbsp;<\/p>\n<p><strong><em><u>Pre-requisite for attending a workshop<\/u><\/em><\/strong><\/p>\n<p>Participants those who are interested in attending this workshop will have to register and make the required payment to attend the workshop.<\/p>\n<p><strong><em><u>Demo\/hands-on<\/u><\/em><\/strong><\/p>\n<p>Instruments and electronic parts to build and program weather stations will be provided. In this workshop, each of the participants will learn how to install the Arduino software on a computer and program, to connect and operate electronic circuits with sensors that measure soil moisture, temperature and humidity at a weather station site. We will station a staff member to stay during the entire workshop to provide an assistance to participants during the practice sessions.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>4ONSE Event &nbsp; 4ONSE is the acronym for “4 times Open and Non-conventional technology for Sensing the Environment”, which is an ongoing research project between University of Moratuwa, Sri Lanka and University of Applied Sciences and Arts of Southern Switzerland. The project aims at developing an experimental, low budget weather station based on open source&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/pages\/841"}],"collection":[{"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/comments?post=841"}],"version-history":[{"count":11,"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/pages\/841\/revisions"}],"predecessor-version":[{"id":1090,"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/pages\/841\/revisions\/1090"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2018\/wp-json\/wp\/v2\/media?parent=841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}