{"id":1630,"date":"2014-10-01T15:34:06","date_gmt":"2014-10-01T08:34:06","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1630"},"modified":"2014-10-10T12:47:03","modified_gmt":"2014-10-10T05:47:03","slug":"abstract-52","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-52\/","title":{"rendered":"(52) Assess the level of vulnerability to climate exaggerated disasters in Sri Lankan Coastal Areas: An Application of Open Source Geographic Information System"},"content":{"rendered":"<p>Topic: Assess the level of vulnerability to climate exaggerated disasters in Sri Lankan Coastal Areas: An Application of Open Source Geographic Information System<\/p>\n<p>Presenter: K.D.P.P.Jayasinghe<\/p>\n<p>Type: Poster<\/p>\n<p>Sri Lankan cities have faced severe impacts of climate change over past years. Past records of daily temperature and rainfall data reveal significant changes of temperature and rainfall patterns during last two decades. Identification of level of vulnerability plays an important role in decision making process. On other hand, most of local and national level instruction face significant constant to geographically analysis those vulnerable area due to unavailability of cost effective methods. rnAs an alternative cost effective method, this paper presents a method to assess the level of vulnerability for climate exaggerated disasters applying open source GIS (Geographic Information System) and rnAHP (Analytical Hierarchical Process). While it certainly hasn’t reached the widespread level of commercial GIS platforms, open source GIS is growing in its use as a viable alternative to commercial GIS. The increased user friendliness of open source GIS software packages like QGIS is leading more and more entities to make the move towards adopting the use of open source software rather purchasing commercial applications in local level in Developing Countries which is a cost effective method to assess the level of vulnerability. Q-GIS was used to identify the distribution of level of vulnerability of each coastal DSD. Application of QGIS help to combine the calculated weights and to assign each weight into DSD spatially and it is selected as the best tool to get a better understanding of the assessment result by representing it spatially. AHP builds a hierarchy of items using comparisons between items expressed as a matrix where, paired comparisons produce weighting scores. It was used to calculate the weights based on the vulnerability of each climate exaggerated disaster on key sector groupings considered critical for national development. Result showed that Negambo, Batticalo, Mundalama, Kalpitiya, Tangalle and Ambalantota are the DSDs with highest level of vulnerability. rnrnKey Words: QGIS, Cost effective method, Climate change, level of vulnerability, AHPrn<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: Assess the level of vulnerability to climate exaggerated disasters in Sri Lankan Coastal Areas:&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1630"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1630"}],"version-history":[{"count":7,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1630\/revisions"}],"predecessor-version":[{"id":1965,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1630\/revisions\/1965"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}