{"id":1636,"date":"2014-10-01T15:39:16","date_gmt":"2014-10-01T08:39:16","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1636"},"modified":"2014-10-09T10:05:49","modified_gmt":"2014-10-09T03:05:49","slug":"abstract-49","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-49\/","title":{"rendered":"(49) A progress and application of a MEXT project for Satellite Data Utilization using FOSS4G"},"content":{"rendered":"<p>Topic: A progress and application of a MEXT project for Satellite Data Utilization using FOSS4G<\/p>\n<p>Presenter: Nobusuke Iwasaki<\/p>\n<p>Email: niwasaki@affrc.go.jp<\/p>\n<p>Type: Panel<\/p>\n<p>Recently, more and more satellite data is becoming easily accessible. For example, NASA provides MODIS and LANDSAT data as Open Data. ESA will provide Sentinel data free and open access for any user. In addition, GIS data may also become accessible under the influence of the global trend of promoting Open Data. In such circumstance, a utilization of satellite images and GIS can be expected growing steadily and widely. However, it is still getting original satellite data and processing it to extract information is quite complicated, especially for non-specialist, such as public-sector employees.<\/p>\n<p>Under such circumstances, Ministry of Education, Culture, Sports, Science and Technology in Japan (MEXT) has considered the plan of removing the barriers on satellite data usage. From 2009 to 2014, we have taken part in research project funded by MEXT, and have strived to overcome some of the existing problem and issues.<\/p>\n<p>The project consisted two phase: the first phase was conducted from 2009 to 2011, and the second phase has been conducted from 2012 until March, 2015. In the first phase, main targets of the project were Japanese and novice user. We conducted three tasks for satellite image utilization for Japanese user.<\/p>\n<p>1. Localizing and Improving FOSS4G tools, such as GRASS, QGIS, GDAL\/OGR and Proj.4, for Japanese user.<\/p>\n<p>2. Making training documentation about processing and analyzing the satellite data with FOSS4G tools.<\/p>\n<p>3. Constructing the e-learning contents of satellite data usage and conducting outreach activity and capacity building.<\/p>\n<p>These resources can download from OSGeo.JP web site (http:\/\/www.osgeo.jp\/foss4g-mext\/).<\/p>\n<p>&nbsp;<\/p>\n<p>Based on outcomes of the first phase, we are started second phase as developing an evaluation system for environmental degradation based on above GRASS and QGIS. In the second phase, we use Global Map (http:\/\/www.iscgm.org\/cgi-bin\/fswiki\/wiki.cgi) as basic information for evaluating environment. The second phase had started from 2012 and focused on natural hazard and environmental degradation, especially in developing countries. In this presentation we present status and progress of the project and also the future plans.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: A progress and application of a MEXT project for Satellite Data Utilization using FOSS4G Presenter: Nobusuke&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1636"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1636"}],"version-history":[{"count":6,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1636\/revisions"}],"predecessor-version":[{"id":1840,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1636\/revisions\/1840"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}