{"id":1638,"date":"2014-10-01T15:41:23","date_gmt":"2014-10-01T08:41:23","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1638"},"modified":"2014-10-09T10:06:02","modified_gmt":"2014-10-09T03:06:02","slug":"abstract-48","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-48\/","title":{"rendered":"(48) A glance review of the FOSSGIS implementation in Indonesia"},"content":{"rendered":"<p>Topic:A glance review of the FOSSGIS implementation in Indonesia<\/p>\n<p>Presenter:Dr. Firman Hadi Darodji<\/p>\n<p>Email: firmanhadi@ait.asia<\/p>\n<p>Type: Panel<\/p>\n<p>GIS plays an important role in supporting development and overcome various problems in Indonesia (Ramadhan et al. 2011). The current trend of GIS implementation in Indonesia is raising since the year of 2000. In this time, proprietary softwares were mainly used to produce geospatial information. Most of the proprietary softwares were acquired illegally. Due to this trend, the Government of Indonesia in 2004 launched an initiative to raise the public awareness in using Open Source Softwares, including in GIS (FOSSGIS). Currently, ten years has been going but the fact shows that the implementations of FOSSGIS in government and private sectors are minimal.<\/p>\n<p>The study aims to know the current status of FOSSGIS implementation in Indonesia. The study used online survey which was disseminated through Remote Sensing \/ GIS Forum Mailing List (rsgisforum-net mailing list). It is one of the largest mailing list in remote sensing and GIS in Indonesia. It has more than 4000 members with more than 100 messages each month. The objective of the survey is to know how often the remote sensing\/GIS community in Indonesia use FOSSGIS for production.<\/p>\n<p>The result shows that most of the users (~ 53 %) seldom and occasionally use FOSSGIS. Thirty four percents of them sometimes and often use FOSSGIS to produce geospatial products. Only 13% usually use FOSSGIS for daily use and none of them use it 100 %. The number of users who own legal vs illegal softwares are nearly equal (56% vs 44%). The reasons of most of users who own legal proprietary softwares are: they accustom to use proprietary softwares and the products have to be develop by proprietary softwares according to the request of their clients. Two interesting results that appear from the survey are: (1) only 9% of the users respond that FOSSGIS are not reliable to make good quality geospatial products, and (2) thirty four percents (34%) of the users, either own legal or illegal proprietary softwares, mention that there are limited human resources whom are capable of using FOSSGIS.<\/p>\n<p>The study implies that FOSSGIS are reliable to produce high quality geospatial products. In the other side, the availability of human resources whom are capable of using FOSSGIS is limited. The study concludes that more education and trainings are needed to increase the knowledge and skills of Remote Sensing\/GIS community in Indonesia. There is also a need to advocate the users of geospatial products (government and private sectors) on the capability of FOSSGIS to deliver high quality geospatial products.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic:A glance review of the FOSSGIS implementation in Indonesia Presenter:Dr. Firman Hadi Darodji Email: firmanhadi@ait.asia Type:&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1638"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1638"}],"version-history":[{"count":5,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1638\/revisions"}],"predecessor-version":[{"id":1841,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1638\/revisions\/1841"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1638"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}