{"id":1653,"date":"2014-10-01T15:50:29","date_gmt":"2014-10-01T08:50:29","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1653"},"modified":"2014-10-09T10:06:16","modified_gmt":"2014-10-09T03:06:16","slug":"abstract-47","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-47\/","title":{"rendered":"(47) Building a webgis system with Python, Tornado, PostGIS and MapServer"},"content":{"rendered":"<p>Topic: Building a webgis system with Python, Tornado, PostGIS and MapServer<\/p>\n<p>Presenter: Yang Chaobin and Bu Kun<\/p>\n<p>Email: yangcb@osgeo.cn<\/p>\n<p>Type: Poster<\/p>\n<p>MapServer is an open source platform for publishing spatial data and interactive mapping applications to the web, and it can run on all major platforms. Pyhton is a programming language whose design philosophy emphasizes code readability, and its syntax allow programmers to express concepts in fewer lines of code.Python can let you work more quickly and integrate systems more effectively, and it has been widely used in scientific researches, such as data processing, model establishment, cartography and so on. In the program of the World Bank, a prediction system is developed, which can forecast the trend of environmental quality in the agricultural producing area in Jilin province, China, and the system also includes the WebGIS function, which can achieve the functions of GIS on the internet. In order to make the most of the existing work and codes, Python is used as the programming language to develop the system. Open source software solutions are chosen because they can save costs. After comparison, Debian\/Linux is chosen as the operating system.Python and Tornado web framework is used to develop web procedure and Postgresql\/PostGIS, which is a spatial database, is the choice of database. MapSever is used to provide the WebGIS service. The results show that the open solutions can completely meet the requirements of the prediction system. Besides, due to the efforts of the Open Source Community, the application and completeness of the system are greatly improved. Python, known as a “Glue Language”, has lots of mature libraries for data processing, web communication, database read and write operations, cartography and the intersection with MapSever. As a result, the development process is relatively quick and the reliability and safety can be guaranteed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: Building a webgis system with Python, Tornado, PostGIS and MapServer Presenter: Yang Chaobin and Bu Kun&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1653"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1653"}],"version-history":[{"count":4,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1653\/revisions"}],"predecessor-version":[{"id":1842,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1653\/revisions\/1842"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}