{"id":1673,"date":"2014-10-01T20:12:21","date_gmt":"2014-10-01T13:12:21","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1673"},"modified":"2014-10-10T12:46:23","modified_gmt":"2014-10-10T05:46:23","slug":"abstract-42","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-42\/","title":{"rendered":"(42) Web-based visualization for vector map based on progressive transmission method"},"content":{"rendered":"<p>Topic:Web-based visualization for vector map based on progressive transmission method<\/p>\n<p>Presenter:Jia Song<\/p>\n<p>Type: Poster<\/p>\n<p>With the popularity of the Internet, web-based geographic information system (WebGIS) is a general trend to publish, share and apply geographical information,ranging from academia through industry to the home user. Spatial data is generally transmitted over the Internet using either a raster- or vector-based representation in web services. Currently, modern web-browsers offer greater support for transmission and visualization of raster map tiles. However, map tiles are weaker in interactivity and powerless in complex spatial geographic analysis. So there are many scenarios, in which web-based vector map may work better. But vector map, especially with large volume, is challenging in web-based visualization and interoperability due to the complexity of vector data on storage and representation. So the strategy of the progressive transmission is proposed by some scholars for improving large-volume vector data application over the Internet.However studies on progressive transmission for large-volume vector data are mostly focused on map generalization of cartography, and there should be more work integrated with information technologies.<\/p>\n<p>The paper first presents a framework of web-based vector map visualization based on progressive transmission. It is composed of server-side vector data organization, streaming progressive transmission, client-side vector data reconstruction and visualization. On the basis of the framework, vector data is divided into several bulks, which are transferred by multiple times under some principles such as scale principle, feature importance principle, etc. The partial data (courser scales or essential features) that first arrives at the client side can be displayed first. In the meanwhile the remaining data is transferred continuously. The details or less important features of the vector data arrive at the client side in the following time.<\/p>\n<p>Then some key methods and technologies for the complex progressive transmission oriented web-based visualization are illustrated, including feature selecting method, streaming progressive transmission technology and web-based vector visualization technology. We present the measurement model for the importance of feature to ensure important features will be transferred first. We also propose to use real-time transmission protocol similar to stream media transmission rather than the common HTTP protocol for progressive transmission. And a kind of structure is designed to facilitate vector streaming progressive transmission. In the meanwhile, the error control and correction strategy is presented to guarantee QoS (Quality of Service) on streaming progressive transmission. The paper discusses some available web-based vector visualization technologies as well. After comparing several vector visualization technologies for web client side, we utilize a JavaScript library called Leaflet for vector map visualization. Taking advantage of HTML5 and CSS3 on modern browsers, Leaflet is designed with simplicity, performance and usability.<\/p>\n<p>The prototype system on web-based visualization for vector map according to the above methods and technologies is developed, using free open source solutions for Geoinfomatics. We use vector datasets with point, line and polygon features to test, and we compare our approach to WFS( Web Feature Service) in the field of transmission efficiency. The result shows that the proposed approach with an implemented system in the paper is far superior to the traditional ways on web-based vector map visualization. After a few seconds, within the users’ tolerance, some of the features of the vector map would begin to render in the web browser by means of proposed vector progressive transmission, and the remaining features are still transferred continuously until the whole map is completely rendered.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic:Web-based visualization for vector map based on progressive transmission method Presenter:Jia Song Type: Poster With&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1673"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1673"}],"version-history":[{"count":5,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1673\/revisions"}],"predecessor-version":[{"id":1958,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1673\/revisions\/1958"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}