{"id":1679,"date":"2014-10-01T20:19:48","date_gmt":"2014-10-01T13:19:48","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1679"},"modified":"2014-11-19T21:52:04","modified_gmt":"2014-11-19T14:52:04","slug":"abstract-38","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-38\/","title":{"rendered":"(38) A system supporting service improvement in Local Authorities of Sri Lanka using FOSS GIS tools"},"content":{"rendered":"<p>Topic: A system supporting service improvement in Local Authorities of Sri Lanka using FOSS GIS tools<\/p>\n<p>Author: Nimalika Fernando<\/p>\n<p><span style=\"color: #575757;\">Type: <\/span><span style=\"color: #575757;\">Oral<\/span><\/p>\n<p>Local Authorities (LAs) face challenges in delivering quality services to citizens due to their extremely limited financial resources. Main income sources for the LAs are the tax collected from properties owned by it. LAs of Sri Lanka establish and maintain local roads. The properties and local roads are inter related therefore the road related information is vital for the development prioritization and tax collections. Presently the road related information are maintained and accessed manually. Therefore it is difficult to get the related spatial information for the development prioritization. Knowing the geographical location of the property is useful when updating the information and identifying any issues in income received. Therefore a GIS based road and revenue source inventory is identified as a main application which can be used to enhance the revenue and support the quality of the service delivery of LAs.rnIn this work, a Road and Revenue Spatial Information System (RRSIS) is designed and developed in order to facilitate the access to road and revenue information by all the stakeholders for the revenue management, maintenance and development activities related to the road network comes under the purview of the respective LAs. The system consists of three modules; a web based system to visualize and update roads and property details, a mobile application to collect field data and administrative panel to manage the system. The officers can visit the area and update the conditions of the roads, the information about advertising boards etc. to the system via the mobile application. These data are synchronized with the main system and can be used for decision making. Both web and the mobile application are Geo enabled. The system is developed using set of FOSS tools including MapServer, PostgreSQL, OpenLayers, and OSM with PHP and Android as the main development languages.rnAsia Foundation acts as the key organization initiating and funding this work under their Local Economic Governance project. It is implemented through a local organization and developed wholly by local developers. The system is under the test implementation in Trincomale District of Sri Lanka and is intended to be extended to other districts also. This is going to be the first FOSS GIS enabled application for LAs of Sri Lanka and the experience in implementing this project would be a valuable resource for such activities in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: A system supporting service improvement in Local Authorities of Sri Lanka using FOSS GIS tools&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1679"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1679"}],"version-history":[{"count":6,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1679\/revisions"}],"predecessor-version":[{"id":2425,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1679\/revisions\/2425"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}