{"id":1694,"date":"2014-10-02T10:05:42","date_gmt":"2014-10-02T03:05:42","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1694"},"modified":"2014-10-10T12:45:43","modified_gmt":"2014-10-10T05:45:43","slug":"abstract-33","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-33\/","title":{"rendered":"(33) Developing a plug-in for FOSS GIS tool: Experience from undergraduates from a Sri Lankan University"},"content":{"rendered":"<p>Topic: Developing a plug-in for FOSS GIS tool: Experience from undergraduates from a Sri Lankan University<\/p>\n<p>Presenter :Kasun Sampath Ramanayake<\/p>\n<p><span style=\"color: #575757;\">Type: <\/span><span style=\"color: #575757;\">Oral<\/span><\/p>\n<p>Being IT undergraduates with no background in GIS or open source software development, we have selected developing a plug-in for QGIS open source software as our final year project and the challenges we have faced and the lessons learned are presented here. The tool developed, FLOOgin is a plug-in for desktop GIS software. The tool can be used immediately after a flood disaster, to analyze an impact of a flood hazard on road network, identify the possible places for IDP camps etc. with a health risk analysis component. It was developed to fill some gaps in the InaSafe plug-in already available for QGIS.<\/p>\n<p>First, the key technologies used in the project were entirely new to the developers; they had no experience in Python, QT development environment, Ubuntu or services like GitHub. The students of the team had no background on GIS also. Though the basic idea related to GIS could have gained via local communities, the development technologies had to be self-learnt. ‘PyQGIS developer cookbook’ and ‘The PyQGIS Programmer’s Guide’ by Gary Sherman provided a great help. In addition, team had to communicate continuously with QGIS developers in other countries, through emails and related mailing lists. Further the forums like ‘Geographic Information Systems Stack Exchange’ were also helpful. The key strength the team had related to the technologies was the knowledge of programming concepts and other programming languages such as C# and Java with certain experiences in applying them in other projects.<\/p>\n<p>Finding free and complete spatial data sets related to floods and other demographic information of Sri Lanka became a problem as no data sharing mechanism available yet for Sri Lanka. As the results generated by the tool depend on the input data that is fed to the QGIS, having sufficient datasets was vital to test the tool. The sample datasets used were finally received through a local training program of InaSafe and from the Survey Department of the Sri Lanka. Further, the lack of well-organized information related to health impacts after a disaster situation became a main barrier in successfully implementing the health risk analysis component of the tool. Finally, the team had to carefully manage the time devoted for this entirely new project idea with other studies since the project comprises only a proportion of the semester subjects. It had to be finished within seven months of time while going through several formal milestones: Proposal, Software Requirement Specification, Final Trial documents plus presentations etc.<\/p>\n<p>Form our experience; it was clear that while technological knowledge is the main challenge, knowledge from different disciplines and working with different organizations is also a main success factor for such a project. We had to deal with Disaster Management related organizations, Ministry of Health and Survey Department for this project. Though the technologies are new to the developers, the support from the world wide open source community and the strong commitment for self-learning proved that this type of work is possible as an undergraduate project in a developing country like Sri Lanka. Finally, by overcoming all the obstacles, most of the sections of the project were successfully implemented within the given time period and tested with sample datasets. The health risk identification component needs further improvements.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: Developing a plug-in for FOSS GIS tool: Experience from undergraduates from a Sri Lankan University&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1694"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1694"}],"version-history":[{"count":4,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1694\/revisions"}],"predecessor-version":[{"id":1950,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1694\/revisions\/1950"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1694"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}