{"id":1810,"date":"2014-10-02T11:44:56","date_gmt":"2014-10-02T04:44:56","guid":{"rendered":"https:\/\/foss4g.asia\/2014\/?page_id=1810"},"modified":"2014-10-10T12:43:58","modified_gmt":"2014-10-10T05:43:58","slug":"abstract-28","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2014\/abstracts\/abstract-28\/","title":{"rendered":"(28) Real-time rainfall Interpolation based on Web Processing Service Using FOSS4G and Open Data"},"content":{"rendered":"<p>Topic: Real-time rainfall Interpolation based on Web Processing Service Using FOSS4G and Open Data<\/p>\n<p>Presenter: Chingchai Humhong<\/p>\n<p><span style=\"color: #575757;\">Type: <\/span><span style=\"color: #575757;\">Oral<\/span><\/p>\n<p>Real time rainfall data is available on the Internet nowadays, and it is most of the time presented as point data for an individual meteorological. This make it possible to fetch data from several stations and to proceed to spatial interpolation. The aim of this study is to implement a method for Real-time Monitoring of Rainfall Values System (RMRVs) and to present technique for spatial interpretation of rainfall data using Free and Open Source Software (FOSS4G) and Open Data. RMRVs is deployed as Web Processing Service (WPS) using the ZOO-Project open source implementation. The latter provide an OGC WPS 1.0.0 compliant engine and allows to create and chain web Services. Several Web Services were developed to process meteorological data and spread it as OGC Web Map Service (WMS) compliant serviced. The RMRVs has been implemented and then rainfall data is automatically download using GeoRSS format from Thailand Hydro and Agro Informatics Institute (HAII) and used PostGIS for storing data. Rainfall data were received using db.connect module and then interpolated using a surface interpolation method (v.surf.idw) which is available as a module of the GRASS GIS software, also used and deployed as WPS. The resulting interpolated real time rainfall data is then automatically published as WMS and can be highlighted on a web interface presenting quantity and distribution of rainfall using generated isoline maps.<\/p>\n<p>Keywords: WPS, WMS, GRASS GIS, Real-time Monitoring of Rainfall Values System<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Topic: Real-time rainfall Interpolation based on Web Processing Service Using FOSS4G and Open Data Presenter: Chingchai&#8230;<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":1621,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-full-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1810"}],"collection":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/comments?post=1810"}],"version-history":[{"count":3,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1810\/revisions"}],"predecessor-version":[{"id":1945,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1810\/revisions\/1945"}],"up":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/pages\/1621"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2014\/wp-json\/wp\/v2\/media?parent=1810"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}