{"id":7,"date":"2023-05-17T00:57:46","date_gmt":"2023-05-17T00:57:46","guid":{"rendered":"https:\/\/gis-ideas.org\/2023\/?page_id=7"},"modified":"2023-08-17T15:38:15","modified_gmt":"2023-08-17T08:38:15","slug":"about","status":"publish","type":"page","link":"https:\/\/gis-ideas.org\/2023\/about\/","title":{"rendered":"ABOUT"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p class=\"has-vivid-cyan-blue-color has-text-color\" style=\"font-size:22px\"><strong>HANOI UNIVERSITY OF NATURAL RESOURCES AND ENVIRONMENT<\/strong><\/p>\n\n\n\n<p style=\"text-align: justify;\"> HUNRE is the Vietnamese public university that belongs to the National Education System, directly under the Viet Nam Ministry of Natural Resources and Environment (MONRE) and has been administrated in education and training by the Viet Nam Ministry of Education and Training (MOET). It has a legal personality and has its own seal and account. The strengths of HUNRE are the convergence of scientists in many different fields, from basic science to applied sciences. Therefore, the linkage of knowledge and cooperation, as well as the mobilization of human resources in science, are carried out conveniently.<\/p>\n\n\n\n<p style=\"text-align: justify;\"> HUNRE has recently carried out scientific research and international collaborative projects and events, so the HUNRE global network of scientists and partners is developing.<\/p>\n\n\n\n<p style=\"text-align: justify;\"> Annually, HUNRE staff and students have carried out hundreds of scientific projects with various funds from the government to private organizations. Almost all topics have been focused on the fields of natural resources and the environment. As a result, these research outcomes have been applied to teaching at HUNRE, making policies, and addressing the initial issues related to natural resources and the environment in Viet Nam and the local provinces of Viet Nam. Hundreds of scientific publications have been published in international and domestic journals on different majors linked to the main topics, natural resources and the environment in general, and other relevant fields. Moreover, lecturers at HUNRE who have participated in building and carrying out national and global scientific projects aim to effectively contribute to the setting of big data on natural resources and the environment that serves the administration and sustainable development.<\/p>\n\n\n\n<p style=\"text-align: justify;\"> HUNRE currently has over 600 lecturers and staff members, with 57.6% of them being women, with Professors and Assoc. Prof. &#8211; 16; PhD &#8211; 85; MSc &#8211; 392 and other degrees. The HUNRE staff have deep knowledge and experience of professional qualifications. And HUNRE has contributed much more to the progress of developing the country, including the economy, environmental protection, national security, and welfare, through scientific products.<br><\/p>\n\n\n\n<p><strong><a href=\"http:\/\/en.hunre.edu.vn\/hunre-en\/trang-chu\" target=\"_blank\" rel=\"noreferrer noopener\">Click on this link to visit the HUNRE website<\/a><\/strong><\/p>\n\n\n\n<div style=\"height:31px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<hr class=\"wp-block-separator aligncenter has-alpha-channel-opacity is-style-wide\"\/>\n\n\n\n<p class=\"has-vivid-cyan-blue-color has-text-color\" style=\"font-size:22px\"><strong>ABOUT OSAKA METROPOLITAN UNIVERSITY (OMU)<\/strong><\/p>\n\n\n\n<p style=\"text-align: justify;\"> Osaka City University, which had been established by the Osaka Municipal Government, and Osaka Prefecture University, which had been established by the Osaka Prefectural Government, merged in 2022 to form Osaka Metropolitan University (OMU). Osaka City University started out as the Osaka Commercial Training Institute, and Osaka Prefecture University as a training school in veterinary science. The histories of both universities date back around 140 years, and their development tracked that of the major city of Osaka as the “City of Water,” a strategic transportation hub, while the city itself has developed alongside these two universities. While covering educational fields as diverse as commerce, agriculture, engineering, and medicine, among others, both universities have utilized their respective geographical advantages to contribute to the development of the spiritual culture required by residents of Osaka as a major city as well as the vitalization of its industry and economy, through the organic fusion of theory and practice.<\/p>\n\n\n\n<p><br><strong><a href=\"https:\/\/www.omu.ac.jp\/en\/\" target=\"_blank\" rel=\"noreferrer noopener\">Click on this link to visit the OMU Website<\/a><\/strong><\/p>\n\n\n\n<div style=\"height:30px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-wide\"\/>\n\n\n\n<p class=\"has-vivid-cyan-blue-color has-text-color\" style=\"font-size:22px\"><strong>ABOUT JAPAN-VIETNAM GEOINFORMATICS CONSORTIUM<\/strong> (<strong>JVGC)<\/strong><\/p>\n\n\n\n<p style=\"text-align: justify;\"> The Japan-Vietnam Geoinformatics Consortium (JVGC) was founded in 2001 to develop and promote Geoinformatics applications and foster cooperation in application of Information and Communication Technologies to problems and issues related to our natural and social environment. To achieve these aims, the JVGC:<\/p>\n\n\n\n<ul>\n<li>support capacity building through organization of symposia, workshops and fieldwork.<\/li>\n\n\n\n<li>share information resources and know-how in Geoinformatics<\/li>\n\n\n\n<li>support the conduct and implementation of joint research and projects in Geoinformatics<\/li>\n\n\n\n<li>promote exchange of information and academic publications<\/li>\n\n\n\n<li>develop a human resource network to support development and growth of Geoinformatics<\/li>\n<\/ul>\n\n\n\n<p><br><a href=\"http:\/\/gisws.media.osaka-cu.ac.jp\/jvgc\/\"><strong>Click on this link to visit the JVGC Website<\/strong><\/a><\/p>\n\n\n\n<div style=\"height:31px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:62px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n","protected":false},"excerpt":{"rendered":"<p>HANOI UNIVERSITY OF NATURAL RESOURCES AND ENVIRONMENT HUNRE is the Vietnamese public university that belongs to the National Education System,&hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-page-builder.php","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/pages\/7"}],"collection":[{"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/comments?post=7"}],"version-history":[{"count":30,"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/pages\/7\/revisions"}],"predecessor-version":[{"id":250,"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/pages\/7\/revisions\/250"}],"wp:attachment":[{"href":"https:\/\/gis-ideas.org\/2023\/wp-json\/wp\/v2\/media?parent=7"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}