{"id":113,"date":"2023-04-16T10:43:29","date_gmt":"2023-04-16T10:43:29","guid":{"rendered":"https:\/\/foss4g.asia\/2023\/?page_id=113"},"modified":"2023-08-13T09:05:40","modified_gmt":"2023-08-13T09:05:40","slug":"code-of-conduct","status":"publish","type":"page","link":"https:\/\/foss4g.asia\/2023\/code-of-conduct\/","title":{"rendered":"Code of Conduct"},"content":{"rendered":"\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\">Code of Conduct<\/h3>\n\n\n\n<p class=\"has-small-font-size\">This code of conduct governs how we behave in any OSGeo forum or event and whenever we will be judged by our actions. We expect it to be honored by everyone who participates in our event.<\/p>\n\n\n\n<p class=\"has-small-font-size\">Participants are expected to act respectfully toward others in accordance with the&nbsp;<a href=\"https:\/\/berlincodeofconduct.org\/\">Berlin Code of Conduct<\/a>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"purpose\">Purpose<\/h3>\n\n\n\n<p class=\"has-small-font-size\">A primary goal of all the conferences and user groups that refer to this Code of Conduct is to be inclusive to the largest number of contributors, with the most varied and diverse backgrounds possible. As such, we are committed to providing a friendly, safe and welcoming environment for all, regardless of gender, sexual orientation, ability, ethnicity, socioeconomic status and religion (or lack thereof).<\/p>\n\n\n\n<p class=\"has-small-font-size\">This Code of Conduct outlines our expectations for all those who participate in our community, as well as the consequences for unacceptable behavior.<\/p>\n\n\n\n<p class=\"has-small-font-size\">We invite all those who participate in our events to help us create safe and positive experiences for everyone.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"open-sourceculturetech-citizenship\">Open [Source\/Culture\/Tech] Citizenship<\/h3>\n\n\n\n<p class=\"has-small-font-size\">A supplemental goal of this Code of Conduct is to increase open [source\/culture\/tech] citizenship by encouraging participants to recognize and strengthen the relationships between our actions and their effects on our community.<\/p>\n\n\n\n<p class=\"has-small-font-size\">Communities mirror the societies in which they exist and positive action is essential to counteract the many forms of inequality and abuses of power that exist in society.<\/p>\n\n\n\n<p class=\"has-small-font-size\">If you see someone who is making an extra effort to ensure our community is welcoming, friendly, and encourages all participants to contribute to the fullest extent, we want to know.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"expected-behavior\">Expected Behavior<\/h3>\n\n\n\n<ul class=\"has-small-font-size\">\n<li>Participate in an authentic and active way. In doing so, you contribute to the health and longevity of this community.<\/li>\n\n\n\n<li>Exercise consideration and respect in your speech and actions.<\/li>\n\n\n\n<li>Attempt collaboration before conflict.<\/li>\n\n\n\n<li>Refrain from demeaning, discriminatory, or harassing behavior and speech.<\/li>\n\n\n\n<li>Be mindful of your surroundings and of your fellow participants. Alert community leaders if you notice a dangerous situation, someone in distress, or violations of this Code of Conduct, even if they seem inconsequential.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"unacceptable-behavior\">Unacceptable Behavior<\/h3>\n\n\n\n<p class=\"has-small-font-size\">Unacceptable behaviors include: intimidating, harassing, abusive, discriminatory, derogatory or demeaning speech or actions by any participant in our community online, at all related events and in one-on-one communications carried out in the context of community business. Community event venues may be shared with members of the public; please be respectful to all patrons of these locations.<\/p>\n\n\n\n<p class=\"has-small-font-size\">Harassment includes: harmful or prejudicial verbal or written comments related to gender, sexual orientation, race, religion, disability; inappropriate use of nudity and\/or sexual images (including presentation slides); inappropriate depictions of violence (including presentation slides); deliberate intimidation, stalking or following; harassing photography or recording; sustained disruption of talks or other events; inappropriate physical contact, and unwelcome sexual attention.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"consequences-of-unacceptable-behavior\">Consequences of Unacceptable Behavior<\/h3>\n\n\n\n<p class=\"has-small-font-size\">Unacceptable behavior from any community member, including sponsors and those with decision-making authority, will not be tolerated. Anyone asked to stop unacceptable behavior is expected to comply immediately.<\/p>\n\n\n\n<p class=\"has-small-font-size\">If a community member engages in unacceptable behavior, the community organizers may take any action they deem appropriate, up to and including a temporary ban or permanent expulsion from the community without warning (and without refund). This actions will be also escalated to the OSGeo CoC committee.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"if-you-witness-or-are-subject-to-unacceptable-behavior\">If You Witness or Are Subject to Unacceptable Behavior<\/h3>\n\n\n\n<p class=\"has-small-font-size\">If you are subject to or witness unacceptable behavior, or have any other concerns, please notify a community organizer as soon as possible. Additionally, community organizers are available to help community members engage with local law enforcement or to otherwise help those experiencing unacceptable behavior feel safe. Organizers may also provide escorts as desired by the person experiencing distress.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"addressing-grievances\">Addressing Grievances<\/h3>\n\n\n\n<p class=\"has-small-font-size\">If you feel you have been falsely or unfairly accused of violating this Code of Conduct, you should notify one of the event organizers with a concise description of your grievance. Your grievance will be handled in accordance with our existing governing policies.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"scope\">Scope<\/h3>\n\n\n\n<p class=\"has-small-font-size\">We expect all community participants (contributors, paid or otherwise; sponsors; and other guests) to abide by this Code of Conduct in all community venues—online and in-person—as well as in all one-on-one communications pertaining to community business.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-vivid-red-color has-text-color\" id=\"license-and-attribution\">License and attribution<\/h3>\n\n\n\n<p class=\"has-small-font-size\">Berlin Code of Conduct is distributed under a Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0) license.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Code of Conduct This code of conduct governs how we behave in any OSGeo forum or event and whenever we will be judged by our actions. We expect it to be honored by everyone who participates in our event. Participants are expected to act respectfully toward others in accordance with the&nbsp;Berlin Code of Conduct. Purpose &hellip; <\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/pages\/113"}],"collection":[{"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/comments?post=113"}],"version-history":[{"count":4,"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/pages\/113\/revisions"}],"predecessor-version":[{"id":256,"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/pages\/113\/revisions\/256"}],"wp:attachment":[{"href":"https:\/\/foss4g.asia\/2023\/wp-json\/wp\/v2\/media?parent=113"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}